src/bsl/InformationRegisters/гкс_ЭлектронныеТабло.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ЭлектронныеТабло</Name>
			<Comment>ERP-1130</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидЗерна</Name>
					<Comment>ERP-1605</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТабло</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ВидыЭлектронныхТабло</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЯмаРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьВОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авто</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Весы</Name>
					<Comment>ERP-1425</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ОборудованиеПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияРегистрации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ВидыЭлектронныхТабло.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ВидыЭлектронныхТабло</Name>
			<Comment>ERP-1130</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеНаВесы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеНаВыгрузку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданияПроб</Name>
					<Comment>ERP-1425</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПрошедшиеРегистрацию</Name>
					<Comment>ERP-2056</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ЭлектронныеТабло/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст запроса для получения данных 
//		для вывода на электронное табло
//
// Параметры:
//  ВидТабло  - Перечисления.гкс_ВидыЭлектронныхТабло - 
//                 вид табло, которые будут обновлять
//
// Возвращаемое значение:
//   Строка   - текст запроса
// 
Функция ТекстЗапросаПоВидуТаблоДляОтображения(ВидТабло) Экспорт
		
	ВидыЭлектронныхТабло = Перечисления.гкс_ВидыЭлектронныхТабло;
	
	Если ВидТабло = ВидыЭлектронныхТабло.НеПрошедшиеРегистрацию Тогда 	
		ТекстЗапроса = ТекстЗапросаОтображениеНаТаблоНепрошедшиеРегистраци();
		
	ИначеЕсли ВидТабло = ВидыЭлектронныхТабло.НазначениеНаВесы Тогда 	
		ТекстЗапроса = ТекстЗапросаОтображениеНаТаблоНазначениеНаВесы();	

	ИначеЕсли ВидТабло = ВидыЭлектронныхТабло.НазначениеНаВыгрузку Тогда
		ТекстЗапроса = ТекстЗапросаОтображениеНаТаблоНазначениеНаВыгрузку();

	ИначеЕсли ВидТабло = ВидыЭлектронныхТабло.ОжиданияПроб Тогда
		ТекстЗапроса = ТекстЗапросаОтображениеНаТаблоОжиданияПроб();
	Иначе
		ТекстЗапроса = "";
	КонецЕсли;
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаОтображениеНаТаблоНепрошедшиеРегистраци()

	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 4
	|	ЭлектронныеТабло.ЗаписьВОчередь КАК ЗаписьВОчередь,
	|	ЭлектронныеТабло.Авто КАК Авто,
	|	ЭлектронныеТабло.Номенклатура КАК Номенклатура,
	|	ЭлектронныеТабло.ВидЗерна КАК ВидЗерна,
	|	ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ПустаяСсылка) КАК Состояние
	|ИЗ
	|	РегистрСведений.гкс_ЭлектронныеТабло КАК ЭлектронныеТабло
	|ГДЕ
	|	ЭлектронныеТабло.ТочкаМаршрута = &ТочкаМаршрута
	|	И ЭлектронныеТабло.ВидТабло = &ВидТабло
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаписьВОчередь";
		
КонецФункции

Функция ТекстЗапросаОтображениеНаТаблоНазначениеНаВесы()

    Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РССостоянияРегистрацииСрезПоследних.ДокументРегистрации КАК ДокументРегистрации,
	|	РССостоянияРегистрацииСрезПоследних.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТСостоянияРегистрации
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(&ДатаСреза, ) КАК РССостоянияРегистрацииСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 4
	|	ЭлектронныеТабло.ЗаписьВОчередь КАК ЗаписьВОчередь,
	|	ЭлектронныеТабло.Авто КАК Авто,
	|	ЭлектронныеТабло.ДокументРегистрации КАК ДокументРегистрации,
	|	ЭлектронныеТабло.Номенклатура КАК Номенклатура,
	|	ЭлектронныеТабло.ВидЗерна КАК ВидЗерна,
	|	ЕСТЬNULL(ВТСостоянияРегистрации.Состояние, ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ПустаяСсылка)) КАК Состояние
	|ИЗ
	|	РегистрСведений.гкс_ЭлектронныеТабло КАК ЭлектронныеТабло
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостоянияРегистрации КАК ВТСостоянияРегистрации
	|		ПО ЭлектронныеТабло.ДокументРегистрации = ВТСостоянияРегистрации.ДокументРегистрации
	|ГДЕ
	|	ЭлектронныеТабло.Номенклатура = &Номенклатура
	|	И ЭлектронныеТабло.ТочкаМаршрута = &ТочкаМаршрута
	|	И ЭлектронныеТабло.ВидТабло = &ВидТабло
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаписьВОчередь";
		
КонецФункции

Функция ТекстЗапросаОтображениеНаТаблоНазначениеНаВыгрузку()

    Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РССостоянияРегистрацииСрезПоследних.ДокументРегистрации КАК ДокументРегистрации,
	|	РССостоянияРегистрацииСрезПоследних.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТСостоянияРегистрации
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(&ДатаСреза, ) КАК РССостоянияРегистрацииСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 4
	|	ЭлектронныеТабло.ЗаписьВОчередь КАК ЗаписьВОчередь,
	|	ЭлектронныеТабло.Авто КАК Авто,
	|	ЭлектронныеТабло.Номенклатура КАК Номенклатура,
	|	ЭлектронныеТабло.ВидЗерна КАК ВидЗерна,
	|	ЕСТЬNULL(ВТСостоянияРегистрации.Состояние, ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ПустаяСсылка)) КАК Состояние
	|ИЗ
	|	РегистрСведений.гкс_ЭлектронныеТабло КАК ЭлектронныеТабло
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостоянияРегистрации КАК ВТСостоянияРегистрации
	|		ПО ЭлектронныеТабло.ДокументРегистрации = ВТСостоянияРегистрации.ДокументРегистрации
	|ГДЕ
	|	ЭлектронныеТабло.ТочкаМаршрута = &ТочкаМаршрута
	|	И ЭлектронныеТабло.ВидТабло = &ВидТабло
	|	И ЭлектронныеТабло.ЯмаРазгрузки = &ЯмаРазгрузки
	|	И ЭлектронныеТабло.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаписьВОчередь";

КонецФункции

Функция ТекстЗапросаОтображениеНаТаблоОжиданияПроб()

    Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РССостоянияРегистрацииСрезПоследних.ДокументРегистрации КАК ДокументРегистрации,
	|	РССостоянияРегистрацииСрезПоследних.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТСостоянияРегистрации
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(&ДатаСреза, ) КАК РССостоянияРегистрацииСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 4
	|	ЭлектронныеТабло.Авто КАК Авто,
	|	ЭлектронныеТабло.ДокументРегистрации КАК ДокументРегистрации,
	|	ЭлектронныеТабло.ЗаписьВОчередь КАК ЗаписьВОчередь,
	|	ЭлектронныеТабло.ЯмаРазгрузки КАК ЯмаРазгрузки,
	|	ВЫБОР
	|		КОГДА ЭлектронныеТабло.ЯмаРазгрузки = ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет,
	|	ЕСТЬNULL(ВТСостоянияРегистрации.Состояние, ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ПустаяСсылка)) КАК Состояние
	|ИЗ
	|	РегистрСведений.гкс_ЭлектронныеТабло КАК ЭлектронныеТабло
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостоянияРегистрации КАК ВТСостоянияРегистрации
	|		ПО ЭлектронныеТабло.ДокументРегистрации = ВТСостоянияРегистрации.ДокументРегистрации
	|ГДЕ
	|	ЭлектронныеТабло.ТочкаМаршрута = &ТочкаМаршрута
	|	И ЭлектронныеТабло.ВидТабло = &ВидТабло
	|	И ЭлектронныеТабло.Весы = &Весы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	ЗаписьВОчередь";

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
